<a href="https://colab.research.google.com/github/hung1012/ML-Basics/blob/main/Pandas_Basics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [19]:
from google.colab import drive
drive.mount('/content/gdrive')

Drive already mounted at /content/gdrive; to attempt to forcibly remount, call drive.mount("/content/gdrive", force_remount=True).

# **Step 1: Import Dataset**

In [3]:
df = pd.read_csv("/content/gdrive/MyDrive/Colab Notebooks/chipotle.tsv", sep = "\t")

In [4]:
df.head(5)

   order_id  ...  item_price
0         1  ...      $2.39
1         1  ...      $3.39
2         1  ...      $3.39
3         1  ...      $2.39
4         2  ...     $16.98

[5 rows x 5 columns]

#**Step 2: Dataset Overview**

In [5]:
df.shape

(4622, 5)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [7]:
df.columns

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

In [8]:
df.index

RangeIndex(start=0, stop=4622, step=1)

In [9]:
df.describe(include="all")

           order_id     quantity     item_name choice_description item_price
count   4622.000000  4622.000000          4622               3376       4622
unique          NaN          NaN            50               1043         78
top             NaN          NaN  Chicken Bowl        [Diet Coke]     $8.75
freq            NaN          NaN           726                134        730
mean     927.254868     1.075725           NaN                NaN        NaN
std      528.890796     0.410186           NaN                NaN        NaN
min        1.000000     1.000000           NaN                NaN        NaN
25%      477.250000     1.000000           NaN                NaN        NaN
50%      926.000000     1.000000           NaN                NaN        NaN
75%     1393.000000     1.000000           NaN                NaN        NaN
max     1834.000000    15.000000           NaN                NaN        NaN

**loc vs iloc**

In [10]:
df.head()

   order_id  ...  item_price
0         1  ...      $2.39
1         1  ...      $3.39
2         1  ...      $3.39
3         1  ...      $2.39
4         2  ...     $16.98

[5 rows x 5 columns]

In [11]:
# select all rows wwith multiple conditions
df.loc[(df.quantity == 2 ) & (df.item_name == "Nantucket Nectar"), ['order_id', 'quantity', 'item_name']]

      order_id  quantity         item_name
601        247         2  Nantucket Nectar
2379       947         2  Nantucket Nectar

In [12]:
#Index Location (iloc)
df.iloc[[9]]

   order_id  ...  item_price
9         5  ...      $9.25

[1 rows x 5 columns]

In [13]:
df.iloc[3:11]

    order_id  ...  item_price
3          1  ...      $2.39
4          2  ...     $16.98
5          3  ...     $10.98
6          3  ...      $1.69
7          4  ...     $11.75
8          4  ...      $9.25
9          5  ...      $9.25
10         5  ...      $4.45

[8 rows x 5 columns]

In [14]:
df.iloc[3:5, :-1]

   order_id  ...                                 choice_description
3         1  ...                                                NaN
4         2  ...  [Tomatillo-Red Chili Salsa (Hot), [Black Beans...

[2 rows x 4 columns]

In [15]:
df.iloc[3:5, [-1]]

  item_price
3     $2.39
4    $16.98

**Data Manipulation**

In [16]:
df.item_price.dtype

dtype('O')

**apply function()**

In [17]:
df.item_price = df.item_price.apply(lambda x: float(x.replace('$', '')))

In [20]:
df.head()

   order_id  ...  item_price
0         1  ...        2.39
1         1  ...        3.39
2         1  ...        3.39
3         1  ...        2.39
4         2  ...       16.98

[5 rows x 5 columns]

In [23]:
df["total_price"] = df.quantity * df.item_price

In [25]:
df.head()

   order_id  quantity  ... item_price total_price
0         1         1  ...       2.39        2.39
1         1         1  ...       3.39        3.39
2         1         1  ...       3.39        3.39
3         1         1  ...       2.39        2.39
4         2         2  ...      16.98       33.96

[5 rows x 6 columns]

In [28]:
#Total revenue
revenue = df["total_price"].sum()
print(revenue)

39237.02

In [38]:
#Most-odered Items Using 'Group By'
c = df.groupby("item_name")["quantity"].sum()
c.sort_values(ascending=False).head(5)

item_name
Chicken Bowl           761
Chicken Burrito        591
Chips and Guacamole    506
Steak Burrito          386
Canned Soft Drink      351
Name: quantity, dtype: int64

In [44]:
#Unique Values
df.item_name.value_counts().count()

50

In [45]:
df.item_name.nunique()

50